# Знакомство с Pandas.

**1. В следующих степах потренируемся использовать изученные функции.**

**Начнем с простого вопроса: что произойдет в результате выполнения следующей команды?**
```python
import pandas as pnds
```
* Сможем использовать библиотеку pandas, обращаясь и как pandas, и как pnds
* Вовсе не сможем использовать библиотеку, потому что использовали сокращение pnds, а не pd
* **Сможем использовать библиотеку pandas, обращаясь к ней как pnds**

In [2]:
import pandas as pd

**2. Отлично! Теперь поработаем с данными о поездках на такси в Нью-Йорке, где также имеется информация о погодных условиях и выходных днях.**  

* pickup_dt – период с точностью до часа

* pickup_month – месяц

* borough – район Нью-Йорка, из которого был сделан заказ (5 районов + аэропорт)

* pickups – число поездок за период (час)

* hday – является ли день праздничным/выходным; Y - да,  N - нет

* spd – скорость ветра в милях в час

* vsb – видимость

* temp – температура в градусах Фаренгейта

* dewp – точка росы по Фаренгейту

* slp – давление

* pcp_01 – количество осадков за час

* pcp_06 – количество осадков за 6 часов

* pcp_24 – количество осадков за 24 часа

* sd – глубина снега в дюймах
      

**Но перед тем, как приступать к работе, давайте загрузим данные. К данным лежит в переменной path_to_file (условно, path_to_file = "/some/path/to/file.csv"). Импортируйте библиотеку pandas, а затем загрузите данные по вышеупомянутой ссылке. **

**Результат сохраните в переменную taxi.**

In [3]:
df = pd.read_csv('2_taxi_nyc.csv', 
                 encoding='windows-1251', sep=',')

In [4]:
df.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

**3. Проверьте, сколько всего строк и столбцов имеется в датасете.**

* **29101 строка, 14 столбцов**

In [5]:
df.shape

(29101, 14)

In [6]:
df.describe()

,pickups,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
count,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000
mean,490.215903,5.984924,8.818125,47.669042,30.823065,1017.817938,0.003830,0.026129,0.090464,2.529169
std,995.649536,3.699007,2.442897,19.814969,21.283444,7.768796,0.018933,0.093125,0.219402,4.520325
min,0.000000,0.000000,0.000000,2.000000,-16.000000,991.400000,0.000000,0.000000,0.000000,0.000000
25%,1.000000,3.000000,9.100000,32.000000,14.000000,1012.500000,0.000000,0.000000,0.000000,0.000000
50%,54.000000,6.000000,10.000000,46.000000,30.000000,1018.200000,0.000000,0.000000,0.000000,0.000000
75%,449.000000,8.000000,10.000000,64.500000,50.000000,1022.900000,0.000000,0.000000,0.050000,2.958333
max,7883.000000,21.000000,10.000000,89.000000,73.000000,1043.400000,0.280000,1.240000,2.100000,19.000000

**4. Давайте посмотрим на типы колонок. Все ли из них считались правильно? В качестве ответа выберите тип, преобладающий в датасете.**

* int64
* **float64**
* datetime64
* object

In [7]:
df.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [8]:
df[['pickup_dt', 'borough']].head()

             pickup_dt    borough
0  2015-01-01 01:00:00      Bronx
1  2015-01-01 01:00:00   Brooklyn
2  2015-01-01 01:00:00        EWR
3  2015-01-01 01:00:00  Manhattan
4  2015-01-01 01:00:00     Queens

In [9]:
df.pickup_dt.value_counts().head(20)

2015-01-01 01:00:00    7
2015-04-26 10:00:00    7
2015-04-26 14:00:00    7
2015-04-26 15:00:00    7
2015-04-26 16:00:00    7
2015-04-26 17:00:00    7
2015-04-26 18:00:00    7
2015-04-26 19:00:00    7
2015-04-26 20:00:00    7
2015-04-26 21:00:00    7
2015-04-26 22:00:00    7
2015-04-26 23:00:00    7
2015-04-27 00:00:00    7
2015-04-27 02:00:00    7
2015-04-27 06:00:00    7
2015-04-27 07:00:00    7
2015-04-27 08:00:00    7
2015-04-27 09:00:00    7
2015-04-27 10:00:00    7
2015-04-27 13:00:00    7
Name: pickup_dt, dtype: int64

In [10]:
df.pickups.sum()

14265773

In [11]:
df.pickups.mean()

490.2159032335659

In [12]:
df.query("borough == 'Manhattan'")

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
10,2015-01-01 02:00:00,Jan,Manhattan,4345,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0
17,2015-01-01 03:00:00,Jan,Manhattan,4577,Y,5.0,10.0,30.0,8.0,1022.3,0.0,0.0,0.0,0.0
24,2015-01-01 04:00:00,Jan,Manhattan,3003,Y,5.0,10.0,29.0,9.0,1022.0,0.0,0.0,0.0,0.0
31,2015-01-01 05:00:00,Jan,Manhattan,1313,Y,5.0,10.0,28.0,9.0,1021.8,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29071,2015-06-30 19:00:00,Jun,Manhattan,4585,N,5.0,10.0,80.0,58.0,1012.5,0.0,0.0,0.0,0.0
29078,2015-06-30 20:00:00,Jun,Manhattan,4210,N,8.0,10.0,80.0,58.0,1012.4,0.0,0.0,0.0,0.0
29085,2015-06-30 21:00:00,Jun,Manhattan,4313,N,7.0,10.0,76.0,61.0,1012.4,0.0,0.0,0.0,0.0
29091,2015-06-30 22:00:00,Jun,Manhattan,4452,N,5.0,10.0,76.0,64.0,1011.9,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [13]:
df.query("temp > 80")

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
19742,2015-05-04 16:00:00,May,Bronx,79,N,7.000000,10.0,81.0,45.0,1022.7,0.0,0.0,0.0,0.0
19743,2015-05-04 16:00:00,May,Brooklyn,374,N,7.000000,10.0,81.0,45.0,1022.7,0.0,0.0,0.0,0.0
19744,2015-05-04 16:00:00,May,EWR,0,N,7.000000,10.0,81.0,45.0,1022.7,0.0,0.0,0.0,0.0
19745,2015-05-04 16:00:00,May,Manhattan,2272,N,7.000000,10.0,81.0,45.0,1022.7,0.0,0.0,0.0,0.0
19746,2015-05-04 16:00:00,May,Queens,413,N,7.000000,10.0,81.0,45.0,1022.7,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29063,2015-06-30 18:00:00,Jun,EWR,0,N,6.333333,10.0,81.0,56.0,1013.4,0.0,0.0,0.0,0.0
29064,2015-06-30 18:00:00,Jun,Manhattan,4298,N,6.333333,10.0,81.0,56.0,1013.4,0.0,0.0,0.0,0.0
29065,2015-06-30 18:00:00,Jun,Queens,345,N,6.333333,10.0,81.0,56.0,1013.4,0.0,0.0,0.0,0.0
29066,2015-06-30 18:00:00,Jun,Staten Island,2,N,6.333333,10.0,81.0,56.0,1013.4,0.0,0.0,0.0,0.0
29067,2015-06-30 18:00:00,Jun,NaN,2,N,6.333333,10.0,81.0,56.0,1013.4,0.0,0.0,0.0,0.0

**5. В названиях столбцов pcp 01, pcp 06, pcp 24 встречается пробел. Это не очень удобно, если в дальнейшем вы планируете обращаться к колонкам через точку, без использования кавычек и скобочек.** 

**Замените пробел в названиях на знак нижнего подчеркивания.**

**Данные сохранены в переменную taxi. Данные должны быть изменены в этом же датафрейме.**

In [14]:
taxi = df.rename(columns={'pcp 01': 'pcp_01', 'pcp 06': 'pcp_06', 'pcp 24': 'pcp_24'})

**6. Вас попросили узнать, сколько записей (строк) в датафрейме относятся к району Манхэттен (Manhattan). Получить ответ на данный вопрос можно было бы, например, с помощью следующей команды:**
```python
taxi.query("borough == 'Manhattan'").shape[0]
```

В shape хранится пара значений вида (x,y) которая обозначает размерность датафрейма. При этом x - размерность по вертикали, т.е. количество строк, А y - по горизонтали, т.е. количество столбцов


**А если мы хотим посмотреть, сколько раз встречается каждый из районов? Неужели придется использовать подобную конструкцию для каждого уровня переменной? Здесь на помощь приходит метод value_counts(), подробнее о котором можно почитать в конспекте!**

**Сколько раз в данных встречается район Бруклин (Brooklyn)?**

In [15]:
taxi.query("borough == 'Manhattan'").shape[0]

4343

In [16]:
taxi.borough.value_counts()

Bronx            4343
Brooklyn         4343
EWR              4343
Manhattan        4343
Queens           4343
Staten Island    4343
Name: borough, dtype: int64

**7. Следующая задача: выяснить, из какого района было совершено наибольшее количество поездок за весь период. Для начала, посчитайте общее количество поездок (pickups), без группировки.**

In [17]:
taxi.pickups.count()

29101

**8. А теперь сгруппируйте данные по району (borough) и укажите, из какого пункта было совершено больше всего поездок.**

* Staten Island
* Brooklyn
* Queens
* Bronx
* **Manhattan**

In [18]:
pickups = taxi \
    .groupby(['borough'], as_index = False) \
    .aggregate({'pickups': 'sum'}) \
    .sort_values('pickups', ascending=False)
pickups

         borough   pickups
3      Manhattan  10367841
1       Brooklyn   2321035
4         Queens   1343528
0          Bronx    220047
5  Staten Island      6957
2            EWR       105

**8а. Усложним задачу. Выполним ту же группировку, но с условием того,что мы выберем только те поездки, в дни которых температура (temp) была больше 80**

In [19]:
pickups = taxi \
    .query("temp > 80") \
    .groupby(['borough'], as_index = False) \
    .aggregate({'pickups': 'sum'}) \
    .sort_values('pickups', ascending=False)
pickups

         borough  pickups
3      Manhattan   640206
1       Brooklyn   140352
4         Queens    88642
0          Bronx    14818
5  Staten Island      493
2            EWR        8

**9. Еще несколько полезных методов в pandas! Возможно, в предыдущем степе вы просто посмотрели на данные или отсортировали значения. Ускорить данный процесс в дальнейшем помогут методы idxmin() и idxmax(), которые возвращают индекс минимального или максимального значения.**

idxmin – индекс минимального значения

idxmax – индекс максимального значения

**Сохраните название района с наименьшим числом поездок в переменную min_pickups, применив подходящий метод.**

**Исходные данные сохранены в переменную taxi.**

In [20]:
min_pickups = taxi \
    .groupby(['borough']) \
    .aggregate({'pickups': 'sum'}) \
    .sort_values('pickups', ascending=False)  \
    .idxmin()

**10. Продолжим изучение данных и посмотрим на число поездок в выходные дни. Сгруппируйте данные по двум признакам: району города и является ли день выходным (колонки borough и hday). Сравните среднее число поездок, и выберите районы, из которых по праздникам в среднем поступает больше заказов, чем в обычные дни.**

* Staten Island
* Brooklyn
* Bronx
* **Queens**
* **EWR**
* Manhattan

In [21]:
weekends = taxi \
    .groupby(['borough', 'hday']) \
    .aggregate({'pickups': 'mean'})
weekends

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

**11. Для каждого района посчитайте число поездок по месяцам. Отсортируйте полученные значения по убыванию и сохраните результирующий датафрейм в pickups_by_mon_bor.**

**Обратите внимание, что итоговый датасет должен состоять из 3-х колонок - pickup_month, borough, pickups.**

**Данные сохранены в переменную taxi.**

In [22]:
pickups_by_mon_bor = taxi \
    .groupby(['borough', 'pickup_month'], as_index=False) \
    .aggregate({'pickups': 'sum'}) \
    .sort_values('pickups', ascending=False)
pickups_by_mon_bor

          borough pickup_month  pickups
21      Manhattan          Jun  1995388
23      Manhattan          May  1888800
19      Manhattan          Feb  1718571
22      Manhattan          Mar  1661261
18      Manhattan          Apr  1648278
20      Manhattan          Jan  1455543
9        Brooklyn          Jun   482466
11       Brooklyn          May   476087
6        Brooklyn          Apr   378095
10       Brooklyn          Mar   346726
7        Brooklyn          Feb   328650
8        Brooklyn          Jan   309011
27         Queens          Jun   286311
29         Queens          May   275893
28         Queens          Mar   219561
24         Queens          Apr   216857
25         Queens          Feb   185695
26         Queens          Jan   159211
5           Bronx          May    53037
3           Bronx          Jun    49006
0           Bronx          Apr    34617
4           Bronx          Mar    32232
1           Bronx          Feb    28694
2           Bronx          Jan    22461
33  Staten Island          Jun     1673
35  Staten Island          May     1517
30  Staten Island          Apr     1068
34  Staten Island          Mar      975
31  Staten Island          Feb      903
32  Staten Island          Jan      821
15            EWR          Jun       29
17            EWR          May       27
16            EWR          Mar       14
13            EWR          Feb       14
14            EWR          Jan       11
12            EWR          Apr       10

**11.  Попрактикуемся в написании собственных функций и их применении к датафрейму. Поскольку данные о поездках в Нью-Йорке, температура представлена в градусах Фаренгейта.**

**Напишите функцию temp_to_celcius, которая получает на вход колонку с температурой в °F, и возвращает значения, переведенные в градусы Цельсия.**

Формула:

t °С = 5/9 (t °F - 32)

Пример работы функции:
```python
> taxi['temp'][:5]
0    30.0
1    30.0
2    30.0
3    30.0
4    30.0

> taxi['temp_C'] = temp_to_celcius(taxi['temp'])
> taxi['temp_C'][:5]
0   -1.111111
1   -1.111111
2   -1.111111
3   -1.111111
4   -1.111111
```

In [23]:
def temp_to_celcius(temp):
    return (temp - 32) * 5 / 9 
taxi['temp_C'] = temp_to_celcius(taxi['temp'])
taxi['temp_C']

0        -1.111111
1        -1.111111
2        -1.111111
3        -1.111111
4        -1.111111
           ...
29096    23.888889
29097    23.888889
29098    23.888889
29099    23.888889
29100    23.888889
Name: temp_C, Length: 29101, dtype: float64